# EntitlementExternalService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..EntitlementExternalService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external service which supports get entitlement information.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId EntitlementExternalService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EntitlementExternalService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ EntitlementExternalService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace